<a href="https://colab.research.google.com/github/smerumeru/DataScience/blob/master/Copy_of_Copy_of_Lab_1_2_2_Pandas_Lab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<div>
<img src=https://www.institutedata.com/wp-content/uploads/2019/10/iod_h_tp_primary_c.svg width="300">
</div>

In [0]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from scipy import stats
# get matplot to show charts inline
%matplotlib inline

chrome://settings/content/cookies

NOTE: Make sure third party cookies are not blocked.

In [6]:
from google.colab import files
uploaded = files.upload()
import io
df = pd.read_csv(io.BytesIO(uploaded["Census Figures from August 2002 to August 2019 - Sheet1.csv"]))

Saving Census Figures from August 2002 to August 2019 - Sheet1.csv to Census Figures from August 2002 to August 2019 - Sheet1 (3).csv

In [9]:
df.head()

                          ... Unnamed: 36
0                    NaN  ...         NaN
1                    NaN  ...      Feb-20
2  TOTALS FOR CEO SYDNEY  ...      70,944
3           ER – PRIMARY  ...      11,844
4              ARNCLIFFE  ...         209

[5 rows x 37 columns]

In [10]:
df.tail()

         Unnamed: 1         Unnamed: 2  ...   #REF! Unnamed: 35 Unnamed: 36
170  NaN        NaN                NaN  ...     NaN         NaN         NaN
171  NaN        NaN     EASTERN REGION  ...   7,821         NaN         NaN
172  NaN        NaN  INNER WEST REGION  ...   7,319         NaN         NaN
173  NaN        NaN    SOUTHERN REGION  ...  11,937         NaN         NaN
174  NaN        NaN   TOTAL SYDNEY CEO  ...  27,077         NaN         NaN

[5 rows x 37 columns]

# Accessing the main DataFrame components

In [0]:
columns = df.columns
index = df.index
data = df.values

In [13]:
columns

Index([' ', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8', 'Unnamed: 9',
       'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12', 'Unnamed: 13',
       'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16', 'Unnamed: 17',
       'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20', 'Unnamed: 21',
       'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24', 'Unnamed: 25',
       'Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28', 'Unnamed: 29',
       'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32', 'Unnamed: 33', '#REF!',
       'Unnamed: 35', 'Unnamed: 36'],
      dtype='object')

In [14]:
index

RangeIndex(start=0, stop=175, step=1)

In [15]:
data

array([[nan, nan, nan, ..., nan, nan, nan],
       [nan, nan, nan, ..., 'Feb-19', 'Aug-19', 'Feb-20'],
       ['TOTALS FOR CEO SYDNEY', nan, nan, ..., '70,128', '69,975',
        '70,944'],
       ...,
       [nan, nan, 'INNER WEST REGION', ..., '7,319', nan, nan],
       [nan, nan, 'SOUTHERN REGION', ..., '11,937', nan, nan],
       [nan, nan, 'TOTAL SYDNEY CEO', ..., '27,077', nan, nan]],
      dtype=object)

# 1. Understanding Data Types

#### 1.A Find Shape of Data Frame

In [16]:
# A:
df.shape

(175, 37)

#### 1.B Find Data Tyeps of Data Frame

In [17]:
# A:
df.dtypes

               object
Unnamed: 1     object
Unnamed: 2     object
Unnamed: 3     object
Unnamed: 4     object
Unnamed: 5     object
Unnamed: 6     object
Unnamed: 7     object
Unnamed: 8     object
Unnamed: 9     object
Unnamed: 10    object
Unnamed: 11    object
Unnamed: 12    object
Unnamed: 13    object
Unnamed: 14    object
Unnamed: 15    object
Unnamed: 16    object
Unnamed: 17    object
Unnamed: 18    object
Unnamed: 19    object
Unnamed: 20    object
Unnamed: 21    object
Unnamed: 22    object
Unnamed: 23    object
Unnamed: 24    object
Unnamed: 25    object
Unnamed: 26    object
Unnamed: 27    object
Unnamed: 28    object
Unnamed: 29    object
Unnamed: 30    object
Unnamed: 31    object
Unnamed: 32    object
Unnamed: 33    object
#REF!          object
Unnamed: 35    object
Unnamed: 36    object
dtype: object

#### 1.C Find Number of Data Types in a Data Frame



```
Expected Output:
int64      5
object    13
dtype: int64
```

#### 1.D Use Info

Use info and explore difference.

In [18]:
# A:
df.info

<bound method DataFrame.info of                             ... Unnamed: 36
0                      NaN  ...         NaN
1                      NaN  ...      Feb-20
2    TOTALS FOR CEO SYDNEY  ...      70,944
3             ER – PRIMARY  ...      11,844
4                ARNCLIFFE  ...         209
..                     ...  ...         ...
170                    NaN  ...         NaN
171                    NaN  ...         NaN
172                    NaN  ...         NaN
173                    NaN  ...         NaN
174                    NaN  ...         NaN

[175 rows x 37 columns]>

# 2. Selecting Column in Data Frame

#### 2.A Check Values of Job_Title column

In [19]:
# A:
columns.values

array([' ', 'Unnamed: 1', 'Unnamed: 2', 'Unnamed: 3', 'Unnamed: 4',
       'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7', 'Unnamed: 8',
       'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12',
       'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15', 'Unnamed: 16',
       'Unnamed: 17', 'Unnamed: 18', 'Unnamed: 19', 'Unnamed: 20',
       'Unnamed: 21', 'Unnamed: 22', 'Unnamed: 23', 'Unnamed: 24',
       'Unnamed: 25', 'Unnamed: 26', 'Unnamed: 27', 'Unnamed: 28',
       'Unnamed: 29', 'Unnamed: 30', 'Unnamed: 31', 'Unnamed: 32',
       'Unnamed: 33', '#REF!', 'Unnamed: 35', 'Unnamed: 36'], dtype=object)

#### 2.B Find How Many Rows Are in Each Job Title



```
# Expected Output
Meat Cutter                        9984
Dairy Person                       8590
Produce Clerk                      8237
.
.
.
```

In [21]:
# A:
numberofrows = 0
print(numberofrows)

0

#### 2.C [BONUS] Write A Function to Row Count



```
def row_count(column_name):
    number_of_rows = 0
    return number_of_rows
```

#### 2.D Describe 'Age'

Find count,  mean,  std, min, max of column 'age'

In [22]:
decribe()

NameError: ignored

##### 2.E [BONUS] Describe 'All Numeric Columns of Data Frame

Find count, mean, std, min, max of of all columns of dataframe

In [0]:
# A:

# 3. Making The Index Meaningful

In [0]:
# A:

#### 3.A Find A Specifc Row Using Index

In [0]:
# A:

#### 3.B Sort Data Frame using Index

In [0]:
# A:

#### 3.C [BONUS] Sort Data Frame using Age

In [0]:
# A:

#### 3.D [BONUS] Using Sample Select Any Row

In [0]:
# A:

# 4. Query Data Frame

#### 4.A Find Rows Where Job_Title is CEO

In [0]:
# A:

#### 4.B Group By Age

In [0]:
# A:

# 5. Visualization

#### 5.A Plot Histogram of Age

In [0]:
# A:

#### 5.B BoxPlot of Age

In [0]:
# A:

#### 5.C Scatterplot of age and length_of_service

In [0]:
# A:

#### 5.D Plot Histogram of store_name

In [0]:
# A:

#### 5.E Print Statistical Summary of Age

In [0]:
# A:



---



---



> > > > > > > > > © 2019 Institute of Data


---



---